import os
from schedule_validator import ScheduleValidator

def main():
    validator = ScheduleValidator()
    
    # Тест 1: Валидация из файла
    print("\nТест 1: Валидация из файла")
    current_dir = os.path.dirname(os.path.abspath(__file__))
    project_root = os.path.dirname(current_dir)
    schedule_file = os.path.join(project_root, 'data', 'schedules', 'ready', 'schedule_variant_2.csv')
    
    print(f"Проверяем файл: {schedule_file}")
    print(f"Файл существует: {os.path.exists(schedule_file)}")
    
    is_valid = validator.validate_schedule(schedule_file)
    print(f"Расписание {'валидно' if is_valid else 'невалидно'}")
    
    # Тест 2: Валидация из строки CSV
    print("\nТест 2: Валидация из строки CSV")
    csv_string = '''"Day","Time","Auditory","Subject","Group","Teacher","Institute"
"Wednesday","14:15","И252","Физика. Часть 2. Основной уровень","АТ-12","Синицин Николай Иванович","ГУК"
"Friday","08:30","М415(IV)","Физика. Часть 2. Основной уровень","АТ-12","Синицин Николай Иванович","ГУК"
"Wednesday","08:30","Ф403","Иностранный язык (Смешанное, УрФУ, СМУДС) Часть 2.A0-A1","СР-54","Коняева Елена Вячеславовна","ФТИ"
"Wednesday","20:50","https","Иностранный язык (Смешанное, УрФУ, СМУДС) Часть 2.A0-A1","СР-54","Коняева Елена Вячеславовна","ОНЛАЙН"
"Tuesday","08:30","Р243","Векторный анализ. ИРИТ-РТФ (09 УГН)","АТ-12","Чернышов Лев Максимович,  Рыжкова Наталия Геннадьевна","ИРИТ-РТФ"
"Wednesday","12:00","Р143","Векторный анализ. ИРИТ-РТФ (09 УГН)","АТ-12","Рыжкова Наталия Геннадьевна,  Чернышов Лев Максимович","ИРИТ-РТФ"
"Friday","08:30","Т216","Векторный анализ. ИРИТ-РТФ (09 УГН)","АТ-12","Чернышов Лев Максимович,  Рыжкова Наталия Геннадьевна","УралЭНИН"
"Tuesday","14:15","СП501","Дополнительные главы математики. ИРИТ-РТФ (09 УГН)","АТ-16","Агафонов Александр Петрович","ИСА"
"Tuesday","16:00","СП501","Дополнительные главы математики. ИРИТ-РТФ (09 УГН)","АТ-16","Агафонов Александр Петрович","ИСА"
"Tuesday","10:15","Р137","Сбор и верификация данных","АТ-03","Мартынов Дмитрий Александрович","ИРИТ-РТФ"
"Tuesday","08:30","Р247","Программирование 2. Комфорт (Python) АИИ и ПИИ","АТ-05","Новиков Максим Юрьевич,  Царегородцев Георгий Павлович","ИРИТ-РТФ"
"Tuesday","10:15","Р247","Программирование 2. Комфорт (Python) АИИ и ПИИ","АТ-05","Царегородцев Георгий Павлович,  Новиков Максим Юрьевич","ИРИТ-РТФ"
"Tuesday","12:00","","Прикладная физическая культура Часть 2 (ИРИТ, ИНМТ, ИНФО)","АТ-02","Морозова Людмила Гарфулловна",""
"Thursday","12:00","","Прикладная физическая культура Часть 2 (ИРИТ, ИНМТ, ИНФО)","АТ-02","Морозова Людмила Гарфулловна",""
"Wednesday","06:50","https","Философия (онлайн, УрФУ, ОК)","АТ-01","Замощанский Иван Игоревич","ОНЛАЙН"
'''
    
    is_valid = validator.validate_schedule(csv_string)
    print(f"Расписание из строки {'валидно' if is_valid else 'невалидно'}")

if __name__ == "__main__":
    main() 